Autodesk.Revit.DB.ViewSheet.CanBeDuplicated(Autodesk.Revit.DB.SheetDuplicateOption)
Identifies if this sheet can be duplicated.
duplicateOption:
The option to use when duplicating the sheet.
Returns:
True if the sheet can be duplicated, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2022.1

Autodesk.Revit.DB.ViewSheet.Duplicate(Autodesk.Revit.DB.SheetDuplicateOption)
Duplicates this sheet to generate a new one.
duplicateOption:
The option to use when duplicating the sheet.
Returns:
The id of the newly created sheet.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Sheet cannot be duplicated
Since:
2022.1

Autodesk.Revit.DB.ViewSheet.SheetNumber
The sheet number of the document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: sheetNumber is an empty string or contains only whitespace.
-or-
When setting this property: sheetNumber cannot include prohibited characters.
-or-
When setting this property: Sheet number is already in use.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null